#利润(I)低于或等于10万元时，奖金可提10%:0.1 * I
#利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%:(I - 10) * 0.015
#20万到40万之间时，高于20万元的部分，可提成5%:(I - 20) * 0.05
# 40万到60万之间时高于40万元的部分，可提成3%:(I - 40) * 0.03
#60万到100万之间时，高于60万元的部分，可提成1.5%:(I - 60) * 0.015
# 高于100万元时，超过100万元的部分按1%提成:(I - 100) * 0.01
#从键盘输入当月利润I，求应发放奖金总数？

I = int(input("Please input your increase(TenThousand):"))
B = 0
if I <= 10 :
    B = 0.1 * I
elif I <= 20:
    B = 0.075 * (I - 10) + 0.1 * 10
elif I <= 40:
    B =(I - 20) * 0.05  + 0.075 * 10 + 0.1 * 10
elif I <= 60:
    B =(I - 40) * 0.03 + 20 * 0.05  + 0.075 * 10 + 0.1 * 10
elif I <= 100:
    B = (I - 60) * 0.015 + 20 * 0.03 + 20 * 0.05  + 0.075 * 10 + 0.1 * 10
elif I >= 100:
    B = (I - 100) * 0.01 + 40 * 0.015 + 20 * 0.03 + 20 * 0.05  + 0.075 * 10 + 0.1 * 10
print(B)